cask_args appdir: "/Applications"

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mas-cli/tap'

# Binaries
brew 'bat'
brew 'fzf'
brew 'fasd'
brew 'coreutils'
brew 'git'
brew 'git-lfs'
brew 'grep'
brew 'mas'
brew 'trash'
brew 'jenv'
brew 'pyenv'
brew 'rbenv'
brew 'zplug'
brew 'speedtest-cli'
brew 'tldr'
brew 'htop'
brew 'mycli'
brew 'neovim'
brew 'tmux'
brew 'jq'

# Apps
cask 'google-chrome'
cask 'firefox'
cask 'temurin8'
cask 'temurin11'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'docker'
cask 'emacs'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'visual-studio-code'
cask 'clipy'
cask 'sourcetree'
cask 'spectacle'
cask 'gas-mask'
cask 'caffeine'
cask 'tunnelblick'
cask 'font-hack-nerd-font'
cask 'obsidian'

# Mac App Store
# mas 'Xcode', id: 497799835
mas 'Kindle', id: 405399194
mas 'Slack', id: 803453959 
mas 'Alfred', id: 405843582 
mas 'Kakaotalk', id: 869223134
